/**
 * @mainpage
 * # Загальне завдання
 * **Переробити** програму, що була розроблена під час виконання лабораторної роботи з теми “Цикли” таким чином, щоб використовувалися функції для обчислення результату.
 * @author Onishchenko D.
 * @date 12-12-2023
 */

/**
 * @file main.c
 * @brief Програма для перевірки, чи є введене число простим.
 * @author Onishchenko D.
 * @date 12-12-2023
 */
#include <stdio.h>

/**
 * @brief Функція для отримання цілого числа від користувача.
 * @return Введене користувачем ціле число.
 */
int getNum() {
    int num;
    printf("Введіть ціле число: ");
    scanf("%d", &num);
    return num;
}

/**
 * @brief Функція для перевірки, чи число є простим.
 * @param num Число для перевірки.
 * @return 1, якщо число є простим, 0 - в іншому випадку.
 */
int isPrime(int num) {
    if (num <= 1) {
        return 0; // Всі числа менше або рівні 1 не є простими
    } else {
        for (int i = 2; i < num; i++) {
            if (num % i == 0) {
                return 0; // Якщо num ділиться на i, то num не є простим числом
            }
        }
        return 1; // Якщо жодне число не ділить num, то num є простим числом
    }
}

/**
 * @brief Головна функція програми.
 * @return 0 в разі успішного завершення програми.
 */
int main() {
    // Значення змінної
    int num;
    int prime = 1;

    // Використання функцій для введення та перевірки числа на простоту
    num = getNum();
    prime = isPrime(num);

    // Виведення результату
    if (prime) {
        printf("%d є простим числом.\n", num);
    } else {
        printf("%d не є простим числом.\n", num);
    }

    return 0;
}


